from random import choice, shuffle
L=[
	'    고토쿠지 미케', '    곽청아', '    나가에 이쿠', '    나마즈', 
	'    나즈린', '    니시다 사토노', '    니와타리 쿠타카', '    대요정', '    도레미 스위트', 
	'    레밀리아 스칼렛', '    레이센 우동게인 이나바', '    레이우지 우츠호', '    레티 화이트락', 
	'    루나 차일드', '    루미아', '    리글 나이트버그', '    릴리 화이트', '    링고', '    마타라 오키나', 
	'    메디슨 멜랑콜리', '    모노노베노 후토', '    모리야 스와코', '    무라사 미나미츠', '    미스티아 로렐라이', 
	'    미야코 요시카', '    미즈하시 파르시', '    사이교우지 유유코', '    사카타 네무노', '    샤메 이마루 아야', 
	'    서니 밀크', '    세이란', '    세키반키', '    소가노 토지코', '    소악마', '    순호', '    스쿠나 신묘마루', 
	'    스타 사파이어', '    시키에이키 야마자나두', '    아키 미 노리코', '    아키 시즈하', '    앨리스 마가트로이드', 
	'    야고코로 에이린', '    야마시로 타카네', '    야사카 카나코', '    야쿠모 란', '    야쿠모 유카리', '    야타데라 나루미', 
	'    에비스 에이카', '    오노즈카 코마치', '    와카사기히메', '    요리가미 시온', '    요리가미 조온', '    우사미 스미레코', 
	'    우시자키 우루미', '    운잔', '    이나바 테위', '    이누바시리 모미지', '    이름 없는 신령', '    이마이즈미 카게로', '    이바라키 카센', 
	'    이부키 스이카', '    이자요이 사쿠야', '    이즈나마루 메구무', '    이터니티 라바', '    조토구 마유미', '    첸', ' 츠쿠모 벤벤',
	'    츠쿠모 야츠하시', '    치르노', '    카기야마 히나', '    카미시라사와 케이네(카미시라사와 케이네/백택)', '    카소다니 쿄코', 
	'    카엔뵤 린', '    카와시로 니토리', '    카자미 유카', '    코마노 아운', '    코마쿠사 산뇨', '    코메이지 사토리', '    코메이지 코이시',
	'    코치야 사나에', '    콘파쿠 요우무', '    쿠다마키 츠카사', '    쿠로다니 야마메', '     쿠로코마 사키', 
	'    쿠모이 이치린', '    클라운피스', '    키리사메 마리사', '    키스메', '    키신 사구메', '    키진 세이자', '    킷초 야치에', 
	'    타마츠쿠리 미스마루', '    타타라 코가사', '    테이레이다 마이', '    텐큐 치마타', '    토라마루 쇼', '    토요사토미미노 미코', 
	'    토테츠 유마', '    파츄리 널릿지', '    프리즘리버 자매', '    루나사 프리즘리버', '    메를랑 프리즘리버', 
	'    리리카 프리즘리버 ', '    플랑드르 스칼렛', '    하니야스신 케이키', '    하쿠레이 레이무', '    하타노 코코로', 
	'    헤카티아 라피스라줄리', '    호라이산 카구야', ' 호리카와 라이코', '    호시구마 유기', '    호쥬 누에', '    홍 메이링', 
	'    후지와라노 모코우', '    후타츠이와 마미조', '    히나나위 텐시', '    히메무시 모모요', '    히메카이도 하타테', '    히지리 뱌쿠렌', 
	'    마에리베리 한', '    우사미 렌코', '와타츠키노 요리히메', '와타츠키노 토요히메', '히에다노 아큐', '모토오리 코스즈'
	]
# print(choice(L).strip())

M=[1,2,3,4,5,6,7,8,9,10,11,12]
shuffle(M)
print(M)